       >> SOURCE FORMAT FREE
IDENTIFICATION DIVISION. 
PROGRAM-ID. ARRAYCOBOL.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT OUTFILE ASSIGN TO "POPULATION.DAT".
DATA DIVISION.
FILE SECTION.
FD OUTFILE
LABEL RECORDS ARE STANDARD
DATA RECORD IS PRINTLINE.
01 PRINTLINE PIC X(80).

WORKING-STORAGE SECTION.
01 Y PIC 9 VALUE ZERO. 
01 X PIC 9 VALUE ZERO. 
01 TOTAL PIC 999 VALUE ZEROS.
01 PRINT-ARRAY.
  02 LEVEL PIC X(10) OCCURS 4 TIMES.
01 INPUT-DATA.
  02 YEAR OCCURS 4 TIMES.
    03 ACCEPT-COURSE OCCURS 2 TIMES PIC 99.
01 TITLE1.
  02 FILLER PIC X(18) VALUE SPACES. 
  02 FILLER PIC X(43) VALUE "COLLEGE OF COMPUTER AND INFORMATION SCIENCE".
01 TITLE2.
  02 FILLER PIC X(31) VALUE SPACES. 
  02 FILLER PIC X(18) VALUE "STUDENT POPULATION".
01 HEAD1.
  02 FILLER PIC X(25) VALUE SPACES.
  02 FILLER PIC X(4) VALUE "YEAR".
  02 FILLER PIC X(5) VALUE SPACES.
  02 FILLER PIC X(4) VALUE "BSIT".
  02 FILLER PIC X(5) VALUE SPACES.
  02 FILLER PIC X(4) VALUE "BSCS".
  02 FILLER PIC X(5) VALUE SPACES.
  02 FILLER PIC X(12) VALUE "TOTAL NUMBER".
01 HEAD2.
  02 FILLER PIC X(52) VALUE SPACES.
  02 FILLER PIC X(11) VALUE "OF STUDENTS".
01 BODY.
  02 FILLER PIC X(22) VALUE SPACES.
  02 PRINT-LEVEL PIC X(14) VALUE SPACES.
  02 PRINT-TOTAL OCCURS 2 TIMES.
    03 PRINT-COURSE PIC ZZ.
    03 FILLER PIC X(6) VALUE SPACES.
  02 FILLER PIC X(4) VALUE SPACES.
  02 PRINT-POPULATION PIC ZZZ.
01 BSIT-TOTAL PIC 999.
01 BSCS-TOTAL PIC 999.
01 FOOT.
  02 FILLER PIC X(22) VALUE SPACES.
  02 FILLER PIC X(14) VALUE "TOTAL".
  02 PRINT-BSIT-TOTAL PIC ZZZ.
  02 FILLER PIC X(5) VALUE SPACES.
  02 PRINT-BSCS-TOTAL PIC ZZZ.
01 QUESTION.
  02 FILLER PIC X(43) VALUE "INPUT THE TOTAL POPULATION OF STUDENTS FOR ".
  02 DISPLAY-COURSE PIC X(4).
  02 FILLER PIC X(1) VALUE " ".
  02 DISPLAY-YEAR PIC X(10).
  02 FILLER PIC X(3) VALUE " : ".

PROCEDURE DIVISION.
OPEN OUTPUT OUTFILE.
PERFORM YEAR-LEVELS.
PERFORM PRINT-DETAILS.
PERFORM ACCEPT-DATA VARYING Y FROM 1 BY 1 UNTIL Y > 4 
AFTER X FROM 1 BY 1 UNTIL X > 2.
PERFORM PRINT-FOOTER.
CLOSE OUTFILE.
STOP RUN.


YEAR-LEVELS.
MOVE "FRESHMEN" TO LEVEL(1).
MOVE "SOPHOMORE" TO LEVEL(2).
MOVE "JUNIOR" TO LEVEL(3).
MOVE "SENIOR" TO LEVEL(4).

PRINT-DETAILS.
WRITE PRINTLINE FROM TITLE1.
WRITE PRINTLINE FROM TITLE2 AFTER ADVANCING 1 LINE.
WRITE PRINTLINE FROM HEAD1  AFTER ADVANCING 2 LINES.
WRITE PRINTLINE FROM HEAD2  AFTER ADVANCING 1 LINE.

ACCEPT-DATA.
PERFORM DISPLAY-QUESTION.
ACCEPT ACCEPT-COURSE(Y,X).
COMPUTE TOTAL = TOTAL + ACCEPT-COURSE(Y,X). 
MOVE LEVEL(Y) TO PRINT-LEVEL.
MOVE TOTAL TO PRINT-POPULATION.
MOVE ACCEPT-COURSE(Y,X) TO PRINT-COURSE(X).
IF X = 2 
COMPUTE BSIT-TOTAL = BSIT-TOTAL + ACCEPT-COURSE(Y,1)
COMPUTE BSCS-TOTAL = BSCS-TOTAL + ACCEPT-COURSE(Y,2)
WRITE PRINTLINE FROM BODY AFTER ADVANCING 1 LINE
MOVE 0 TO TOTAL
END-IF.

DISPLAY-QUESTION.
MOVE LEVEL(Y) TO DISPLAY-YEAR.
IF X = 1 MOVE "BSIT" TO DISPLAY-COURSE
ELSE MOVE "BSCS" TO DISPLAY-COURSE
END-IF.
DISPLAY QUESTION WITH NO ADVANCING.

PRINT-FOOTER.
MOVE BSIT-TOTAL TO PRINT-BSIT-TOTAL.
MOVE BSCS-TOTAL TO PRINT-BSCS-TOTAL.
WRITE PRINTLINE FROM FOOT AFTER ADVANCING 1 LINE.
